Tekla Open API Reference for Tekla Structures 2025
ProfileName Properties
The ProfileName type exposes the following members.
Properties
Name | Description
Name
 The profile item name.
Top
See Also
Reference
ProfileName Class
Tekla.Structures.Catalogs Namespace